[
    {
      "id": "preparation_narrative",
      "img1": "../pictures/pic1.jpg",
      "img2": "../pictures/pic1.jpg",
      "img3": "../pictures/pic1.jpg",
      "title": "Preparation Narrative",
      "date": "June 24, 2023",
      "content1": "The narrative report aims to provide a comprehensive overview of the upcoming Civic Welfare Training Service (CWTS) project conducted by our university class. The CWTS project serves as a platform for our class to engage in community service activities. Our specific objective is to clean and paint gutters to improve the overall appearance and cleanliness of our community. To accomplish this, various stakeholders are involved, including the class members, the executive team, the budgeting team, and the documentation team. The project requires effective planning, organization, and allocation of responsibilities to ensure its successful execution.",
      "content2": "Significant progress has been made in preparing for the project. On June 4, we conducted our first face-to-face meeting, during which we discussed crucial details, such as the materials required for the project. We compiled a comprehensive list, encompassing cleaning materials like soap, scrubs, trash bags, buckets, and painting materials such as one gallon of paint, paint brushes, and rollers. Additionally, we established the executive team, budgeting team, and documentation team, clearly assigning roles and responsibilities to each member. To further facilitate coordination and decision-making, we held an online meeting on June 9, utilizing the Discord platform.",
      "content3": "During this session, we finalized project details, including the project timeline, which confirmed that the project would be carried out from 8:00 am to 10:00 am on June 25. Additionally, we addressed the financial aspect, determining the contribution amount per student. Contributions were set at 130 Pesos for students attending the immersion and 260 Pesos for those unable to attend. To ensure an organized workflow, we divided participants into two groups: one for painting and another for cleaning.",
      "content4": "As we approached the project date, we encountered a challenge in procuring the materials. Some students faced difficulties purchasing the required items due to their distant residence from the university. To address this challenge, we coordinated with the affected students and provided them with alternative solutions. We explored options for centralizing the material procurement process, including utilizing online platforms or coordinating with local suppliers near the university. Fortunately, we were able to overcome this challenge, as we successfully purchased the materials needed for the project on June 22 and June 24, 2023. This three-day period allowed us to gather all the required cleaning and painting materials, ensuring that we had everything prepared for the project on June 25.",
      "content5": "As the scheduled date for the CWTS project approaches, we are confident in our preparations and the dedication of the project team and class members. Despite the challenges we encountered, we worked collaboratively to find suitable solutions. With the materials procured on June 22 and June 24, we are fully prepared to execute the project and create a positive impact on our community. We anticipate a successful and impactful project that promotes cleanliness and enhances the aesthetic appeal of our surroundings. The lessons learned from this experience, such as effective online communication, coordination, and timely procurement, will contribute to our personal and professional growth. We eagerly await the execution of the project and the positive and lasting impact it will create in our community."
    },

    {
        "id": "immersion_day_narrative",
        "img1": "../pictures/pic2.jpg",
        "img2": "../pictures/pic2.jpg",
        "img3": "../pictures/pic2.jpg",
        "img4": "../pictures/pic2.jpg",
        "title": "Immersion Day Narrative",
        "date": "June 25, 2023",
        "content1": "The CWTS Immersion was organized as an integral part of the university's community service initiatives, actively involving students in practical endeavors aimed at enhancing the campus environment. Our class was specifically assigned the task of cleaning and repainting the gutters, to restore their original bright yellow color. To efficiently carry out the assignments, we formed separate teams dedicated to the cleaning and painting processes, commencing the immersion promptly at 8:00 AM. ",

        "content2": "The cleaning phase presented us with challenges that necessitated quick thinking and resourcefulness. Initially, we inadvertently began working on the wrong side of the gutter; however, we promptly rectified the situation and proceeded with the correct approach. From 8:00 AM to 9:20 AM, we diligently cleared the gutters of leaves and debris, ensuring a pristine surface for the subsequent painting process. In addition to this initial obstacle, we encountered further difficulties concerning the suitability of the scrapers we had acquired. Realizing their inadequacy for the concrete surface, we promptly took action by procuring appropriate scrapers, thanks to the assistance of our classmates who procured the necessary materials. At 10:00 AM, we resumed the immersion and embarked on a thorough cleaning of the gutters, employing brushes and detergent soap to effectively remove any adhering dirt. This meticulous cleaning process demanded approximately 30 minutes to accomplish. Moreover, from 10:00 AM to 10:30 AM, we meticulously scraped off the existing paint, ensuring a smooth and primed surface ready for the application of fresh paint. Regrettably, due to the aforementioned challenges, the immersion did not proceed as initially planned, resulting in an extension of our efforts until 12:30 PM. From 10:30 AM to 11:00 AM, we meticulously applied the first layer of bright yellow paint, striving for a uniform and visually appealing finish. Following a 20-minute drying period, we diligently proceeded to administer a second layer from 11:30 AM to 12:00 PM, ensuring a consistently vibrant and captivating appearance. Upon completion of the immersion activities, we seized the opportunity to take a well-deserved break and collectively enjoyed refreshments while admiring the fruits of our labor. Notably, at noon, our classmates procured food and beverages, which we gratefully indulged in while appreciating the remarkable transformation achieved through our joint efforts.",

        "content3": "Despite the encountered challenges, the CWTS Immersion exerted a profound impact on the cleanliness and aesthetic appeal of the campus environment. Our diligent efforts in cleaning the gutters eliminated leaves, dirt, and other debris, significantly improving the overall tidiness of the surroundings. Furthermore, the careful scraping of the old paint and the application of fresh coats of bright yellow paint contributed to a remarkable transformation of the gutters, enhancing their visual appeal and adding a touch of charm to the campus.",

        "content4": "This immersion experience provided us with invaluable lessons and insights. We recognized the importance of meticulous planning, adaptability, and effective problem-solving. The initial oversight of starting on the wrong side of the gutter underscored the significance of double-checking instructions and ensuring accuracy in our approach. Similarly, the issue with unsuitable scrapers reinforced the need for thorough research and consideration when procuring materials for a project. The experience also highlighted the value of teamwork and resourcefulness, as our classmates who facilitated the acquisition of additional materials showcased the power of collaboration and support within a team.",
      
        "content5": "Moving forward, we recommend conducting thorough research and carefully selecting appropriate tools and materials before initiating any project. Attention to detail during the planning can significantly prevent issues and delays. It is also advisable to establish contingency plans to address unforeseen challenges and allocate buffer time to accommodate unexpected circumstances. Furthermore, fostering a sense of resourcefulness and teamwork within the group is essential. Encouraging open communication and collaboration enables the pooling of ideas and facilitates the discovery of creative solutions to problems.",

        "content6": "In conclusion, the CWTS Immersion undertaken on June 25, 2023, was a transformative experience that impacted the cleanliness and aesthetic appeal of our university campus. Through our dedicated efforts in cleaning and repainting the gutters, we successfully revitalized their appearance, contributing to an improved campus environment. This immersion taught us valuable lessons in planning, adaptability, and problem-solving while also highlighting the significance of teamwork and resourcefulness. We are grateful for the opportunity to contribute to our community and remain committed to furthering the goals of civic welfare."
        
      },

      {
        "id": "conclusion_narrative",
        "img1": "../pictures/pic3.jpg",
        "img2": "../pictures/pic3.jpg",
        "img3": "../pictures/pic3.jpg",
        "title": "Conclusion Narrative",
        "date": "June 28, 2023",
        "content1": "The immersion has become a new milestone for us: starting from the planning and meetings to teamwork in cleaning and painting, we are able not only to do teamwork but also to know even more our classmates and teacher through the laughs and hardships that we have been through during the preparation and actual engagement.",
        
        "content2": "We express our deepest gratitude to our CWTS professor and the university administration for their guidance and support throughout the immersion. We would also like to thank our Block President, Vice President, the Block Officers, Committees, and the other Bachelor of Science in Information Technology (BSIT) 1 - 4 students who participated, provided their time, showed impressive efforts,  and made this immersion titled, “ Transforming Spaces, Inspiring Minds: Iskolar ng Bayan's Clean-Up Drive and Repainting Project for our Sintang Paaralan”,  possible to be held and conducted.",

        "content3": "The lessons learned from this experience will indeed be applied to future initiatives, ensuring thorough planning, adaptability, and effective teamwork. By doing so, we will enhance our community service endeavors and contribute positively to our campus and surrounding.",

        "content4": "Despite the enervation and weariness right after the immersion day, the finished work gave a warm feeling to our hearts and minds as students of our Sintang Paaralan as we knew that we are able to give the school a clean and newly painted gutter giving everyone at the university a vibrant feel."
      }
  ]